Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Adds a narrow strip on the window's leading edge listing every connection and database you have open, so one click switches to it.
fr: Ajoute une bande étroite sur le bord supérieur de la fenêtre répertoriant toutes les connexions et bases de données que vous avez ouvertes, de sorte qu'en un clic, vous pouvez passer à celle-ci.
ko: 열어 둔 모든 연결과 데이터베이스를 나열하는 좁은 막대를 윈도우 왼쪽 가장자리에 추가하여 클릭 한 번으로 전환할 수 있습니다.
tr: Pencerenin sol kenarında açık her bağlantıyı ve veritabanını listeleyen dar bir şerit ekler; tek tıkla geçiş yaparsınız.
vi: Thêm một dải hẹp ở cạnh trái cửa sổ liệt kê mọi kết nối và cơ sở dữ liệu đang mở, chỉ cần một cú nhấp để chuyển sang.
zh_hans: 在窗口前缘添加一条窄栏，列出所有已打开的连接和数据库，单击即可切换。
zh_hant: 在視窗前緣加入一條窄列，列出所有已開啟的連線與資料庫，單擊即可切換。

source: Reading this connection's database options…
fr: Lecture des options de base de données de cette connexion...

source: Default, as SQL
fr: Par défaut, comme SQL

source: Drop External Table
fr: Déposer la table externe
ko: 외부 테이블 삭제
tr: Harici Tabloyu Sil
vi: Xóa External Table
zh_hans: 删除外部表
zh_hant: 捨棄外部資料表

source: Change…
fr: Changer...

source: %lld connection(s) use this profile. They will fall back to no SSH tunnel.
fr: %lld connexion(s) utilisent ce profil. Elles passeront à un tunnel SSH non disponible.
ko: %lld개 연결이 이 프로필을 사용합니다. SSH 터널을 사용하지 않도록 전환됩니다.
tr: %lld bağlantı bu profili kullanıyor. SSH tüneli olmadan bağlanmaya geri dönecekler.
vi: %lld kết nối đang sử dụng hồ sơ này. Chúng sẽ chuyển về không dùng SSH tunnel.
zh_hans: %lld 个连接正在使用此配置。它们将回退为不使用 SSH 隧道。
zh_hant: %lld 個連線正在使用此設定檔。它們將改為不使用 SSH 隧道。

source: Accent Color:
fr: Couleur d'accent :
ko: 강조 색상:
tr: Vurgu Rengi:
vi: Màu nhấn:
zh_hans: 强调色：
zh_hant: 強調色：

source: Reading the file…
fr: Lecture du fichier...

source: Object Type
fr: Type d'objet
ko: 객체 유형
tr: Nesne Türü
vi: Loại đối tượng
zh_hans: 对象类型
zh_hant: 物件類型

source: This connection's client key is not readable on this device (%@). Key files do not sync between devices, so add the key here before connecting.
fr: La clé client de cette connexion n'est pas lisible sur cet appareil (%@). Les fichiers clés ne se synchronisent pas entre les appareils, alors ajoutez la clé ici avant de vous connecter.
ko: 이 기기에서 이 연결의 클라이언트 키를 읽을 수 없습니다(%@). 키 파일은 기기 간에 동기화되지 않으므로 연결하기 전에 이 기기에 키를 추가하십시오.
tr: Bu bağlantının istemci anahtarı bu cihazda okunamıyor (%@). Anahtar dosyaları cihazlar arasında eşitlenmez, bu yüzden bağlanmadan önce anahtarı buraya ekleyin.
vi: Không đọc được khóa máy khách của kết nối này trên thiết bị này (%@). Tệp khóa không đồng bộ giữa các thiết bị, nên hãy thêm khóa tại đây trước khi kết nối.
zh_hans: 此连接的客户端密钥在本设备上不可读（%@）。密钥文件不会在设备之间同步，请先在此处添加密钥再连接。
zh_hant: 此連線的用戶端金鑰在本裝置上無法讀取（%@）。金鑰檔案不會在裝置之間同步，請先在此處加入金鑰再連線。

source: Integrations
fr: Intégrations
ko: 통합
tr: Entegrasyonlar
vi: Tích hợp
zh_hans: 集成
zh_hant: 整合

source: Font
fr: Police de caractères
ko: 글꼴
tr: Yazı Tipi
vi: Phông chữ
zh_hans: 字体
zh_hant: 字型

source: Open External Database Connection?
fr: Ouvrir la connexion à la base de données externe ?
ko: 외부 데이터베이스 연결을 여시겠습니까?
tr: Harici Veritabanı Bağlantısı Açılsın mı?
vi: Mở kết nối cơ sở dữ liệu bên ngoài?
zh_hans: 打开外部数据库连接？
zh_hant: 開啟外部資料庫連線？

source: Light
fr: Lumière
ko: 라이트
tr: Açık
vi: Sáng
zh_hans: 浅色
zh_hant: 淺色

source: private (%@)
fr: Privé (%@)
ko: 비공개(%@)
tr: özel (%@)
zh_hans: 私有（%@）
zh_hant: 私有（%@）

source: Requests
fr: Demandes

source: Import into:
fr: Importer dans :
ko: 가져올 위치:
tr: Şuraya içe aktar:
vi: Nhập vào:
zh_hans: 导入到：
zh_hant: 匯入到：

source: Invalid data format: %@
fr: Format de données invalide : %@
ko: 잘못된 데이터 형식: %@
tr: Geçersiz veri biçimi: %@
vi: Định dạng dữ liệu không hợp lệ: %@
zh_hans: 数据格式无效: %@
zh_hant: 資料格式無效：%@

source: Database Switch Failed
fr: Échec du commutateur de base de données
ko: 데이터베이스 전환 실패
tr: Veritabanı Değiştirme Başarısız
vi: Chuyển cơ sở dữ liệu thất bại
zh_hans: 切换数据库失败
zh_hant: 切換資料庫失敗

source: Waiting
fr: Attente

source: Expires %@
fr: Expire %@
ko: %@ 만료
tr: Bitiş: %@
vi: Hết hạn %@
zh_hans: %@ 到期
zh_hant: %@ 到期

source: Edit %@ Connection
fr: Modifier la connexion %@
ko: %@ 연결 편집
tr: %@ Bağlantısını Düzenle
vi: Sửa kết nối %@
zh_hans: 编辑 %@ 连接
zh_hant: 編輯 %@ 連線

source: (this Mac)
fr: (ce Mac)
ko: (이 Mac)
tr: (bu Mac)
vi: (máy Mac này)
zh_hans: （此 Mac）
zh_hant: （這台 Mac）

source: An external table
fr: Une table externe

source: Filtering by only this row
fr: Filtrage uniquement par cette ligne
ko: 이 행만 기준으로 필터링 중
tr: Yalnızca bu satıra göre filtreleniyor
vi: Đang chỉ lọc theo hàng này
zh_hans: 正在仅按此行筛选
zh_hant: 正在僅依此列篩選

source: Connection Status
fr: Statut de la connexion
ko: 연결 상태
tr: Bağlantı Durumu
vi: Trạng thái kết nối
zh_hans: 连接状态
zh_hant: 連線狀態

source: Edit Column
fr: Modifier la colonne
ko: 열 편집
tr: Sütunu Düzenle
vi: Sửa cột
zh_hans: 编辑列
zh_hant: 編輯欄位

source: No saved connections
fr: Aucune connexion enregistrée
ko: 저장된 연결 없음
tr: Kayıtlı bağlantı yok
vi: Không có kết nối đã lưu
zh_hans: 没有已保存的连接
zh_hant: 沒有已儲存的連線

source: No Tables Yet
fr: Pas encore de tables
ko: 아직 테이블 없음
tr: Henüz Tablo Yok
vi: Chưa có bảng
zh_hans: 尚无表
zh_hant: 尚無資料表

source: Recheck
fr: Révérifier
ko: 다시 확인
tr: Yeniden Denetle
vi: Kiểm tra lại
zh_hans: 重新检查
zh_hant: 重新檢查

source: Max schema tables: %lld
fr: Tables de schéma max : %lld
ko: 최대 스키마 테이블 수: %lld
tr: Max schema tablo: %lld
vi: Số bảng tối đa: %lld
zh_hans: Schema 最大表数：%lld
zh_hant: 綱要資料表上限：%lld

source: Enter a name for the new table.
fr: Entrez un nom pour la nouvelle table.

source: Create a database using the engine's own form options. Call describe_create_database_options first to see which options this engine takes. Needs tools:write and the user's approval.
fr: Créez une base de données en utilisant les options de formulaire de l'engine lui-même. Appelez d'abord describe_create_database_options pour voir quelles options cet engine prend. Nécessite des outils : l'écriture et l'approbation de l'utilisateur.
ko: 엔진 고유의 폼 옵션을 사용해 데이터베이스를 만듭니다. 이 엔진이 받는 옵션을 보려면 먼저 describe_create_database_options를 호출하십시오. tools:write와 사용자 승인이 필요합니다.
tr: Motorun kendi form seçeneklerini kullanarak bir veritabanı oluşturur. Bu motorun hangi seçenekleri aldığını görmek için önce describe_create_database_options çağırın. tools:write ve kullanıcının onayı gerekir.
vi: Tạo một cơ sở dữ liệu bằng chính các tuỳ chọn biểu mẫu của engine. Hãy gọi describe_create_database_options trước để xem engine này nhận những tuỳ chọn nào. Cần tools:write và sự phê duyệt của người dùng.
zh_hans: 使用引擎自己的表单选项创建数据库。请先调用 describe_create_database_options 查看该引擎接受哪些选项。需要 tools:write 和用户批准。
zh_hant: 使用引擎自己的表單選項建立資料庫。請先呼叫 describe_create_database_options 查看該引擎接受哪些選項。需要 tools:write 和使用者核准。

source: Table List
fr: Liste de table
ko: 테이블 목록
tr: Tablo Listesi
vi: Danh sách bảng
zh_hans: 表列表
zh_hant: 資料表清單

source: The bundled sample database is missing from the app.
fr: La base de données d'échantillons groupée est manquante dans l'application.
ko: 앱에 포함된 샘플 데이터베이스가 없습니다.
tr: Uygulamayla birlikte gelen örnek veritabanı eksik.
vi: Cơ sở dữ liệu mẫu đi kèm bị thiếu trong ứng dụng.
zh_hans: 应用中缺少内置的示例数据库。
zh_hant: 應用程式中缺少內建的範例資料庫。

source: Integrations: Running
fr: Intégrations : Exécution
ko: 통합: 실행 중
tr: Entegrasyonlar: Çalışıyor
vi: Tích hợp: Đang chạy
zh_hans: 集成：运行中
zh_hant: 整合：執行中

source: Profiles
fr: Profils

source: Never
fr: Jamais
ko: 안 함
tr: Asla
vi: Không bao giờ
zh_hans: 从不
zh_hant: 永不

source: Get Table Statistics
fr: Obtenir des statistiques de table
ko: 테이블 통계 가져오기
tr: Tablo İstatistiklerini Al
vi: Lấy thống kê bảng
zh_hans: 获取表统计信息
zh_hant: 取得資料表統計資訊

source: Routine name
fr: Nom de la routine
ko: 루틴 이름
tr: Rutin adı
vi: Tên routine
zh_hans: 例程名称
zh_hant: 常式名稱

source: This statement drops or truncates data.
fr: Cette instruction supprime ou tronque les données.

source: UNGROUPED
fr: NON GROUPÉ
ko: 그룹 없음
tr: GRUPSUZ
vi: KHÔNG THUỘC NHÓM
zh_hans: 未分组
zh_hant: 未分組

source: Model
fr: Modèle
ko: 모델

source: Column reorder failed: %@
fr: Réorganisation de la colonne échouée : %@
ko: 열 순서 변경 실패: %@
tr: Sütun yeniden sıralama başarısız: %@
vi: Sắp xếp lại cột thất bại: %@
zh_hans: 列重排序失败：%@
zh_hant: 欄位重新排序失敗：%@

source: No custom commands yet.
fr: Pas encore de commandes personnalisées.
ko: 아직 사용자 지정 명령이 없습니다.
tr: Henüz özel komut yok.
vi: Chưa có lệnh tùy chỉnh nào.
zh_hans: 还没有自定义命令。
zh_hant: 還沒有自訂指令。

source: MCP Server: Running (%d clients)
fr: Serveur MCP : En cours d'exécution (%d clients)
ko: MCP 서버: 실행 중(클라이언트 %d개)
tr: MCP Sunucusu: Çalışıyor (%d istemci)
vi: MCP Server: Đang chạy (%d client)
zh_hans: MCP 服务器：运行中（%d 个客户端）
zh_hant: MCP 伺服器：執行中（%d 個用戶端）

source: Show password
fr: Afficher le mot de passe
ko: 암호 보기
tr: Parolayı göster
vi: Hiện mật khẩu
zh_hans: 显示密码
zh_hant: 顯示密碼

source: The server did not answer in time.
fr: Le serveur n'a pas répondu à temps.

# Plugin requires PluginKit version %lld, but app provides version %lld
source: Plugin requires PluginKit version %1$lld, but app provides version %2$lld
fr: Le plugin nécessite la version PluginKit %1$lld, mais l'application fournit la version %2$lld.
ko: 플러그인에는 PluginKit %1$lld 버전이 필요하지만 앱에서 제공하는 버전은 %2$lld입니다
tr: Plugin requires PluginKit version %lld, but app provides version %lld
vi: Plugin yêu cầu PluginKit phiên bản %lld, nhưng ứng dụng cung cấp phiên bản %lld
zh_hans: 插件需要 PluginKit 版本 %lld，但应用提供的版本为 %lld
zh_hant: 外掛需要 PluginKit 版本 %1$lld，但應用程式提供的版本為 %2$lld

source: No text column to search
fr: Aucune colonne de texte à rechercher
ko: 검색할 텍스트 열이 없습니다
tr: Aranacak metin sütunu yok
vi: Không có cột văn bản để tìm
zh_hans: 没有可搜索的文本列
zh_hant: 沒有可搜尋的文字欄位

source: Copy Token
fr: Copier le jeton
ko: 토큰 복사
tr: Token Kopyala
vi: Sao chép token
zh_hans: 复制令牌
zh_hant: 複製權杖

source: Remove “%@”?
fr: Supprimer "%@" ?
ko: “%@”을(를) 제거하시겠습니까?
tr: “%@” kaldırılsın mı?
vi: Gỡ “%@”?
zh_hans: 要移除“%@”吗？
zh_hant: 要移除「%@」嗎？

source: Debounce: %d ms
fr: Débounce : %d ms
ko: 디바운스: %d ms
tr: Bekleme: %d ms
zh_hans: 防抖：%d 毫秒
zh_hant: 去抖動：%d 毫秒

source: This will permanently delete all conversation history.
fr: Cela supprimera définitivement tout historique de conversation.
ko: 모든 대화 기록을 영구적으로 삭제합니다.
tr: Bu işlem tüm konuşma geçmişini kalıcı olarak silecek.
vi: Hành động này sẽ xóa vĩnh viễn toàn bộ lịch sử hội thoại.
zh_hans: 这将永久删除所有对话历史。
zh_hant: 此操作將永久刪除所有對話記錄。

source: Current database: %@ (read-only, ⌘K to switch)
fr: Base de données actuelle : %@ (en lecture seule, ⌘K pour basculer)
ko: 현재 데이터베이스: %@ (읽기 전용, 전환하려면 ⌘K)
tr: Mevcut veritabanı: %@ (salt okunur, değiştirmek için ⌘K)
vi: Cơ sở dữ liệu hiện tại: %@ (chỉ đọc, ⌘K để chuyển)
zh_hans: 当前数据库：%@（只读，⌘K 切换）
zh_hant: 目前的資料庫：%@（唯讀，⌘K 切換）

source: The MCP server started without a port
fr: Le serveur MCP a démarré sans port.
ko: MCP 서버가 포트 없이 시작되었습니다
tr: MCP sunucusu bir bağlantı noktası olmadan başladı
vi: Máy chủ MCP khởi động mà không có cổng
zh_hans: MCP 服务器启动时没有端口
zh_hant: MCP 伺服器啟動時沒有連接埠

source: Views
fr: Vues
ko: 뷰
tr: Görünümler
zh_hans: 视图
zh_hant: 檢視表

source: This column needs a name.
fr: Cette colonne a besoin d'un nom.

source: Delete %d Connections
fr: Supprimer %d connexions
ko: 연결 %d개 삭제
tr: %d Bağlantıyı Sil
vi: Xoá %d kết nối
zh_hans: 删除%d个连接
zh_hant: 刪除 %d 個連線

source: %1$d of %2$d rows, %3$d marked for deletion
fr: %1$d de %2$d lignes, %3$d marquées pour suppression
ko: %2$d행 중 %1$d행, %3$d행 삭제 예정
tr: %2$d satırdan %1$d tanesi, %3$d tanesi silinmek üzere işaretli
vi: %1$d trên %2$d hàng, %3$d hàng được đánh dấu xoá
zh_hans: %2$d 行中的 %1$d 行，%3$d 行已标记删除
zh_hant: %2$d 列中的 %1$d 列，%3$d 列已標記刪除

source: 'since' must not be later than 'until'.
fr: « since » ne doit pas être postérieur à « until ».
ko: 'since'는 'until'보다 늦을 수 없습니다.
tr: 'since', 'until' değerinden sonra olamaz.
vi: 'since' không được muộn hơn 'until'.
zh_hans: 'since' 不能晚于 'until'。
zh_hant: 'since' 不能晚於 'until'。

source: Install one with “brew install postgresql@%@”.
fr: Installez-en un avec "brew install postgresql@%@".

source: No limit
fr: Pas de limite
ko: 제한 없음
tr: Sınır yok
vi: Không giới hạn
zh_hans: 不限制
zh_hant: 不限制

source: %@ is left with no unique index a concurrent refresh can use, so REFRESH MATERIALIZED VIEW CONCURRENTLY fails on it.
fr: %@ ne dispose plus d'un index unique que peut utiliser une mise à jour concurrente, de sorte que REFRESH MATERIALIZED VIEW CONCURRENTLY échoue sur celui-ci.

source: Quick Switcher (⇧⌘O)
fr: Interrupteur rapide (⇧⌘O)
ko: 빠른 전환(⇧⌘O)
tr: Hızlı Geçiş (⇧⌘O)
vi: Chuyển đổi nhanh (⇧⌘O)
zh_hans: 快速切换 (⇧⌘O)
zh_hant: 快速切換器 (⇧⌘O)

source: No changes to apply.
fr: Aucune modification à appliquer.

source: postgresql://user:password@host:5432/database
fr: postgresql://utilisateur:motdepasse@hôte:5432/base de données

source: With no precision on the source, the column keeps 38 significant digits. A longer value is rounded.
fr: Sans précision sur la source, la colonne conserve 38 chiffres significatifs. Une valeur plus longue est arrondie.

source: This database cannot drop triggers
fr: Cette base de données ne peut pas supprimer les déclencheurs.
ko: 이 데이터베이스에서는 트리거를 삭제할 수 없습니다
tr: Bu veritabanı tetikleyici silemez
vi: Cơ sở dữ liệu này không thể xoá trigger
zh_hans: 此数据库无法删除触发器
zh_hant: 此資料庫無法刪除觸發器

source: Apply a row limit when running queries and cap results at the configured row count
fr: Appliquer une limite de lignes lors de l'exécution des requêtes et limiter les résultats au nombre de lignes configuré.
ko: 쿼리 실행 시 행 제한을 적용하고 결과를 설정된 행 수로 제한
tr: Sorguları çalıştırırken satır limiti uygula ve sonuçları ayarlanan satır sayısıyla sınırla
vi: Áp dụng giới hạn dòng khi chạy truy vấn và giới hạn kết quả ở số dòng đã cấu hình
zh_hans: 运行查询时应用行数限制，并将结果限制在配置的行数内
zh_hant: 執行查詢時套用列數上限，並將結果限制在設定的列數內

source: Open Connection Window
fr: Ouvrir la fenêtre de connexion
ko: 연결 윈도우 열기
tr: Bağlantı Penceresini Aç
vi: Mở cửa sổ kết nối
zh_hans: 打开连接窗口
zh_hant: 開啟連線視窗

source: Drop %1$@ “%2$@”…
fr: Déposez %1$@ "%2$@"...
ko: %1$@ “%2$@” 삭제…
tr: %1$@ “%2$@” Sil…
vi: Xoá %1$@ “%2$@”…
zh_hans: 删除%1$@“%2$@”…
zh_hant: 刪除%1$@「%2$@」…

source: Recent Queries
fr: Requêtes récentes
ko: 최근 쿼리
tr: Son Sorgular
vi: Truy vấn gần đây
zh_hans: 最近的查询
zh_hant: 最近的查詢

source: Explain one table's columns, keys, indexes, and DDL to someone who has never used it
fr: Expliquez les colonnes, les clés, les index et les DDL d'une table à quelqu'un qui ne l'a jamais utilisée.
ko: 한 테이블의 열, 키, 인덱스, DDL을 처음 접하는 사람에게 설명합니다
tr: Bir tablonun sütunlarını, anahtarlarını, indekslerini ve DDL'ini daha önce hiç kullanmamış birine açıklar
vi: Giải thích cột, khoá, chỉ mục và DDL của một bảng cho người chưa từng dùng nó
zh_hans: 向从未用过这张表的人讲解它的列、键、索引和 DDL
zh_hant: 向從未用過這張資料表的人講解它的欄位、鍵、索引和 DDL

source: Duplicate constraint name: %@
fr: Nom de contrainte duplicé : %@

source: Table the change applies to, if it is one table
fr: Tableau à laquelle le changement s'applique, s'il s'agit d'un seul tableau
ko: 변경이 적용되는 테이블이며, 단일 테이블인 경우에 한합니다
tr: Tek bir tabloysa değişikliğin uygulandığı tablo
vi: Bảng mà thay đổi áp dụng lên, nếu chỉ có một bảng
zh_hans: 该更改所作用的表，前提是只涉及一张表
zh_hant: 該變更所作用的資料表，前提是只涉及一張資料表

source: Not Now
fr: Pas maintenant
ko: 나중에
tr: Şimdi Değil
vi: Để sau
zh_hans: 以后再说
zh_hant: 稍後再說

source: Drop Role
fr: Rôle de chute
ko: 역할 삭제
tr: Rolü Sil
vi: Xoá vai trò
zh_hans: 删除角色
zh_hant: 刪除角色

source: Discard Changes?
fr: Jeter les modifications ?
ko: 변경 사항을 폐기하시겠습니까?
tr: Değişiklikler Atılsın mı?
vi: Hủy bỏ thay đổi?
zh_hans: 丢弃更改?
zh_hant: 要捨棄變更嗎？

source: Restore this version of "%@"?
fr: Restaurer cette version de "%@" ?

source: Index size
fr: Taille de l'indice
ko: 인덱스 크기
tr: İndeks boyutu
vi: Kích thước chỉ mục
zh_hans: 索引大小
zh_hant: 索引大小

source: Table-level CHECK constraints
fr: Contraintes de VÉRIFIER au niveau de la table

source: No slow queries
fr: Pas de requêtes lentes
ko: 느린 쿼리 없음
tr: Yavaş sorgu yok
vi: Không có truy vấn chậm
zh_hans: 没有慢查询
zh_hant: 沒有慢查詢

source: Remove Foreign Key
fr: Supprimer la clé étrangère
ko: 외래 키 제거
tr: Yabancı Anahtarı Kaldır
vi: Gỡ khóa ngoại
zh_hans: 移除外键
zh_hant: 移除外鍵

source: Run statement
fr: Déclaration de mise en marche
ko: 문 실행
tr: İfadeyi çalıştır
vi: Chạy câu lệnh
zh_hans: 运行语句
zh_hant: 執行陳述式

source: Keyword case:
fr: Cas des mots-clés :

source: Verified
fr: Vérifié
ko: 확인됨
vi: Đã xác minh
zh_hans: 已验证
zh_hant: 已驗證

source: is not empty
fr: N'est pas vide
ko: 비어 있지 않음
tr: boş değil
vi: không trống
zh_hans: 不为空
zh_hant: 不為空

source: This file is stored with Git LFS. Restore it with your Git client.
fr: Ce fichier est stocké avec Git LFS. Récupérez-le avec votre client Git.

source: Column type, for a column match
fr: Type de colonne, pour une correspondance de colonne
ko: 열이 일치할 때의 열 유형
tr: Bir sütun eşleşmesi için sütun türü
vi: Kiểu cột, khi khớp theo cột
zh_hans: 列类型，用于列匹配
zh_hant: 欄位類型，用於欄位比對

source: Focus an already-open tab by id (returned from list_recent_tabs).
fr: Concentrez-vous sur une onglet déjà ouverte par identifiant (renvoyé par list_recent_tabs).
ko: 이미 열려 있는 탭에 ID로 포커스를 맞춥니다(list_recent_tabs에서 반환).
tr: Zaten açık bir sekmeye id ile odaklanır (list_recent_tabs tarafından döndürülür).
vi: Chuyển đến một tab đang mở theo id (trả về từ list_recent_tabs).
zh_hans: 按 id 聚焦已打开的标签页（id 由 list_recent_tabs 返回）。
zh_hant: 依 id 聚焦已開啟的分頁（id 由 list_recent_tabs 回傳）。

source: Changing the primary key rebuilds the table and can fail on duplicate values.
fr: La modification de la clé primaire reconstruit la table et peut échouer en cas de valeurs duplicates.
ko: 기본 키를 변경하면 테이블을 다시 만들며, 값이 중복되면 실패할 수 있습니다.
tr: Birincil anahtarı değiştirmek tabloyu yeniden oluşturur ve yinelenen değerlerde başarısız olabilir.
vi: Đổi khóa chính sẽ dựng lại bảng và có thể thất bại khi có giá trị trùng lặp.
zh_hans: 更改主键会重建表，并可能因重复值而失败。
zh_hant: 變更主鍵會重建資料表，並可能因重複值而失敗。

source: Metric unit
fr: Unité métrique
ko: 지표 단위
tr: Metrik birimi
vi: Đơn vị chỉ số
zh_hans: 指标单位
zh_hant: 指標單位

source: Referenced row not found
fr: Rang référencé non trouvé
ko: 참조된 행을 찾을 수 없음
tr: Referans satır bulunamadı
vi: Không tìm thấy dòng tham chiếu
zh_hans: 未找到引用行
zh_hant: 找不到參考的列

source: Session Context
fr: Contexte de la session

source: What to Compare
fr: Ce qu'il faut comparer
ko: 비교할 대상
tr: Neler Karşılaştırılacak
vi: So sánh những gì
zh_hans: 比较哪些内容
zh_hant: 比較哪些內容

source: Use
fr: Utiliser
ko: 사용
tr: Kullan
vi: Dùng
zh_hans: 使用
zh_hant: 使用

source: Allow
fr: Autoriser
ko: 허용
tr: İzin Ver
vi: Cho phép
zh_hans: 允许
zh_hant: 允許

source: Don't show this again
fr: Ne montre pas ça à nouveau
ko: 다시 표시하지 않기
tr: Bunu bir daha gösterme
vi: Không hiện lại
zh_hans: 不再显示
zh_hant: 不再顯示

source: Insert Column Left
fr: Insérer la colonne à gauche
ko: 왼쪽에 열 삽입
tr: Sola Sütun Ekle
vi: Chèn cột bên trái
zh_hans: 在左侧插入列
zh_hant: 在左方插入欄位

source: Getting Started
fr: Commencer
ko: 시작하기
tr: Başlarken
vi: Bắt đầu
zh_hans: 入门
zh_hant: 入門

source: CLI tool "%@" not found in PATH
fr: L'outil CLI "%@" n'a pas été trouvé dans le PATH.
ko: PATH에서 CLI 도구 "%@"을(를) 찾을 수 없습니다
tr: CLI aracı "%@" PATH içinde bulunamadı
vi: Không tìm thấy công cụ CLI "%@" trong PATH
zh_hans: 在 PATH 中未找到 CLI 工具 "%@"
zh_hant: 在 PATH 中找不到 CLI 工具「%@」

source: Save replaces the whole document with this text. A field you remove is removed, and _id cannot change.
fr: Enregistrer remplace tout le document par ce texte. Un champ que vous supprimez est supprimé, et _id ne peut pas changer.

source: Multiple values
fr: Plusieurs valeurs
ko: 여러 값
tr: Birden fazla değer
vi: Nhiều giá trị
zh_hans: 多个值
zh_hant: 多個值

source: connection failed
fr: connexion échouée
ko: 연결 실패
tr: bağlantı başarısız
vi: kết nối thất bại
zh_hans: 连接失败
zh_hant: 連線失敗

source: Sync Conflict
fr: Conflit de synchronisation
ko: 동기화 충돌
vi: Xung đột đồng bộ
zh_hans: 同步冲突
zh_hant: 同步衝突

source: SQL Dialect
fr: Dialecte SQL
ko: SQL 방언
vi: Phương ngữ SQL
zh_hans: SQL 方言
zh_hant: SQL 方言

source: Apply…
fr: Postuler...
ko: 적용…
tr: Uygula…
vi: Áp dụng…
zh_hans: 应用…
zh_hant: 套用…

source: Open in Window
fr: Ouvrir dans une fenêtre
ko: 윈도우에서 열기
tr: Pencerede Aç
vi: Mở trong cửa sổ
zh_hans: 在窗口中打开
zh_hant: 在視窗中開啟

source: Quick Switcher...
fr: Interrupteur rapide...
ko: 빠른 전환...
vi: Chuyển đổi nhanh...
zh_hans: 快速切换...
zh_hant: 快速切換器…

source: Filter objects
fr: Filtrer les objets
ko: 객체 필터링
tr: Nesneleri filtrele
vi: Lọc đối tượng
zh_hans: 筛选对象
zh_hant: 篩選物件

# %lld row%@ to export
source: %1$lld row%2$@ to export
fr: %1$lld ligne%2$@ à exporter
ko: %1$lld개 행%2$@ 내보내기
tr: %lld satır%@ dışa aktarılacak
vi: %lld hàng%@ để export
zh_hans: %lld 行%@待导出
zh_hant: 待匯出 %1$lld 列%2$@

source: Tables and their columns for the database a connection is browsing. Capped at 100 tables.
fr: Les tables et leurs colonnes pour la base de données dont la connexion est en cours de navigation. Limité à 100 tables.
ko: 연결이 탐색 중인 데이터베이스의 테이블과 각 테이블의 열입니다. 최대 100개 테이블로 제한됩니다.
tr: Bir bağlantının göz attığı veritabanı için tablolar ve sütunları. En fazla 100 tabloyla sınırlıdır.
vi: Các bảng và cột của chúng cho cơ sở dữ liệu mà một kết nối đang duyệt. Giới hạn ở 100 bảng.
zh_hans: 某个连接正在浏览的数据库的表及其列。最多 100 张表。
zh_hant: 某個連線正在瀏覽的資料庫的資料表及其欄位。最多 100 張資料表。

source: Choose Backup Folder
fr: Choisissez le dossier de sauvegarde

source: Google did not return a refresh token. Remove TablePro's access in your Google Account settings, then sign in again.
fr: Google n'a pas renvoyé un jeton de rafraîchissement. Supprimez l'accès de TablePro dans les paramètres de votre compte Google, puis connectez-vous à nouveau.

source: Permission Level
fr: Niveau de permission
ko: 권한 수준
tr: İzin Düzeyi
vi: Mức quyền
zh_hans: 权限级别
zh_hant: 權限層級

source: Failed to encode connection data
fr: Échec de l'encodage des données de connexion.
ko: 연결 데이터를 인코딩하지 못했습니다
tr: Bağlantı verileri kodlanamadı
vi: Không thể mã hóa dữ liệu kết nối
zh_hans: 无法编码连接数据
zh_hant: 無法編碼連線資料

source: Choose a key column before comparing data.
fr: Choisissez une colonne clé avant de comparer les données.
ko: 데이터를 비교하기 전에 키 열을 선택하십시오.
tr: Veriyi karşılaştırmadan önce bir anahtar sütun seçin.
vi: Chọn cột khóa trước khi so sánh dữ liệu.
zh_hans: 比较数据前请先选择键列。
zh_hant: 比較資料前請先選擇鍵欄位。

source: SSH Verification Required
fr: Vérification SSH requise
ko: SSH 확인 필요
tr: SSH Doğrulaması Gerekli
vi: Cần xác minh SSH
zh_hans: 需要 SSH 验证
zh_hant: 需要 SSH 驗證

source: Failed to delete template: %@
fr: Échec de la suppression du modèle : %@
ko: 템플릿을 삭제하지 못했습니다: %@
tr: Şablon silinemedi: %@
vi: Xóa mẫu thất bại: %@
zh_hans: 删除模板失败: %@
zh_hant: 刪除範本失敗：%@

source: Toggle Filters (⇧⌘F)
fr: Changer les filtres (⇧⌘F)
ko: 필터 표시/숨기기(⇧⌘F)
tr: Filtreleri Aç/Kapat (⇧⌘F)
vi: Bật/tắt bộ lọc (⇧⌘F)
zh_hans: 切换筛选 (⇧⌘F)
zh_hant: 切換篩選 (⇧⌘F)

source: File format
fr: Format de fichier

source: Return table counts and sizes for one database, or for every database when 'database' is omitted.
fr: Renvoie le nombre et la taille des tables d'une base de données, ou pour chaque base de données lorsque le mot "base de données" est omis.
ko: 한 데이터베이스의 테이블 수와 크기를 반환하며, 'database'를 생략하면 모든 데이터베이스를 대상으로 합니다.
tr: Bir veritabanı için, 'database' verilmediğinde ise her veritabanı için tablo sayılarını ve boyutlarını döndürür.
vi: Trả về số lượng bảng và kích thước cho một cơ sở dữ liệu, hoặc cho mọi cơ sở dữ liệu khi bỏ trống 'database'.
zh_hans: 返回某个数据库的表数量和大小；省略 'database' 时返回每个数据库的。
zh_hant: 回傳某個資料庫的資料表數量和大小；省略 'database' 時回傳每個資料庫的。

source: The target driver cannot generate statements.
fr: Le pilote cible ne peut pas générer de déclarations.

source: TablePro did not open a window for that connection in time.
fr: TablePro n'a pas ouvert une fenêtre pour cette connexion à temps.
ko: TablePro가 제한 시간 안에 해당 연결의 창을 열지 못했습니다.
tr: TablePro, o bağlantı için zamanında bir pencere açmadı.
vi: TablePro đã không mở kịp cửa sổ cho kết nối đó.
zh_hans: TablePro 没有及时为该连接打开窗口。
zh_hant: TablePro 沒有及時為該連線開啟視窗。

source: This Save Cannot Be Restored
fr: Ce sauvegarde ne peut pas être restauré.
ko: 이 저장은 복원할 수 없음
tr: Bu Kayıt Geri Yüklenemez
vi: Không thể khôi phục lần lưu này
zh_hans: 这次保存无法恢复
zh_hant: 這次儲存無法還原
